noeldiviney/Eicon/1.0.1/boards.txt
# See: https://github.com/arduino/Arduino/wiki/Arduino-IDE-1.5-3rd-party-Hardware-specification
#  Eicon Boards
menu.pnum=Board part number

menu.xserial=U(S)ART support
menu.usb=USB support (if available)
menu.xusb=USB speed (if available)

menu.opt=Optimize
menu.rtlib=C Runtime Library
menu.upload_method=Upload method

################################################################################
# DRD 144 boards

DRD_144.name=DRD-144

#DRD_144.build.vid=0x0483
#DRD_144.build.core=STM32:arduino
#DRD_144.build.board=DRD_144
#DRD_144.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

DRD_144.build.vid=0x0483
DRD_144.build.core=STM32:arduino
DRD_144.build.board=DRD_144
DRD_144.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}
DRD_144.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
DRD_144.build.series=STM32F4xx
DRD_144.build.cmsis_lib_gcc=arm_cortexM4l_math

# DRD_Vibos_F427ZI board
# Support: USB HID, Serial1 (USART1 on PG9, PG14) and Serial2 (USART2 on PD6, PD5)
DRD_144.menu.pnum.VIBOS_F427ZI=DRD Vibos F427ZI
DRD_144.menu.pnum.VIBOS_F427ZI.node=NODE_F427ZI
DRD_144.menu.pnum.VIBOS_F427ZI.upload.maximum_size=2097152
DRD_144.menu.pnum.VIBOS_F427ZI.upload.maximum_data_size=262144
DRD_144.menu.pnum.VIBOS_F427ZI.build.board=DRD_Vibos_F427ZI
DRD_144.menu.pnum.VIBOS_F427ZI.build.product_line=STM32F427xx
DRD_144.menu.pnum.VIBOS_F427ZI.build.variant=DRD_Vibos_F427ZI

# DRD_Silo8_F427ZI board
# Support: USB HID, Serial1 (USART1 on PG9, PG14) and Serial2 (USART2 on PD6, PD5)
#DRD_144.menu.pnum.SILO8_F427ZI=DRD Silo8 F427ZI
#DRD_144.menu.pnum.SILO8_F427ZI.node=NODE_F427ZI
#DRD_144.menu.pnum.SILO8_F427ZI.upload.maximum_size=2097152
#DRD_144.menu.pnum.SILO8_F427ZI.upload.maximum_data_size=262144
#DRD_144.menu.pnum.SILO8_F427ZI.build.board=DRD_Silo8_F427ZI
#DRD_144.menu.pnum.SILO8_F427ZI.build.product_line=STM32F427xx
#DRD_144.menu.pnum.SILO8_F427ZI.build.variant=DRD_Silo8_F427ZI

# DRD_Blink_F427ZI board
# Support: USB HID, Serial1 (USART1 on PG9, PG14) and Serial2 (USART2 on PD6, PD5)
DRD_144.menu.pnum.BLINK_F427ZI=DRD Blink F427ZI
DRD_144.menu.pnum.BLINK_F427ZI.node=NODE_F427ZI
DRD_144.menu.pnum.BLINK_F427ZI.upload.maximum_size=2097152
DRD_144.menu.pnum.BLINK_F427ZI.upload.maximum_data_size=262144
DRD_144.menu.pnum.BLINK_F427ZI.build.board=DRD_Blink_F427ZI
DRD_144.menu.pnum.BLINK_F427ZI.build.product_line=STM32F427xx
DRD_144.menu.pnum.BLINK_F427ZI.build.variant=DRD_Blink_F427ZI

# DRD_Blink_F429ZI board
# Support: USB HID, Serial1 (USART1 on PG9, PG14) and Serial2 (USART2 on PD6, PD5)
DRD_144.menu.pnum.BLINK_F429ZI=DRD Blink F429ZI
DRD_144.menu.pnum.BLINK_F429ZI.node=NODE_F429ZI
DRD_144.menu.pnum.BLINK_F429ZI.upload.maximum_size=2097152
DRD_144.menu.pnum.BLINK_F429ZI.upload.maximum_data_size=262144
DRD_144.menu.pnum.BLINK_F429ZI.build.board=DRD_Blink_F429ZI
DRD_144.menu.pnum.BLINK_F429ZI.build.product_line=STM32F429xx
DRD_144.menu.pnum.BLINK_F429ZI.build.variant=DRD_Blink_F429ZI


# Upload menu
DRD_144.menu.upload_method.MassStorage=Mass Storage
DRD_144.menu.upload_method.MassStorage.upload.protocol=
DRD_144.menu.upload_method.MassStorage.upload.tool=massStorageCopy

DRD_144.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
DRD_144.menu.upload_method.swdMethod.upload.protocol=0
DRD_144.menu.upload_method.swdMethod.upload.options=-g
DRD_144.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

DRD_144.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
DRD_144.menu.upload_method.serialMethod.upload.protocol=1
DRD_144.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
DRD_144.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

DRD_144.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
DRD_144.menu.upload_method.dfuMethod.upload.protocol=2
DRD_144.menu.upload_method.dfuMethod.upload.options=-g
DRD_144.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# DRD 64 boards

DRD_64.name=DRD-64

DRD_64.build.vid=0x0483
DRD_64.build.core=STM32:arduino
DRD_64.build.board=DRD_64
DRD_64.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# DRD_F030R8 board
DRD_64.menu.pnum.DRD_F030R8=DRD F030R8
DRD_64.menu.pnum.DRD_F030R8.node="NODE_F030R8,DRD"
DRD_64.menu.pnum.DRD_F030R8.upload.maximum_size=65536
DRD_64.menu.pnum.DRD_F030R8.upload.maximum_data_size=8192
DRD_64.menu.pnum.DRD_F030R8.build.mcu=cortex-m0
DRD_64.menu.pnum.DRD_F030R8.build.board=DRD_Blink_F030R8
DRD_64.menu.pnum.DRD_F030R8.build.series=STM32F0xx
DRD_64.menu.pnum.DRD_F030R8.build.product_line=STM32F030x8
DRD_64.menu.pnum.DRD_F030R8.build.variant=DRD_Blink_F030R8
DRD_64.menu.pnum.DRD_F030R8.build.cmsis_lib_gcc=arm_cortexM0l_math

# DRD_F091RC board
DRD_64.menu.pnum.DRD_F091RC=DRD F091RC
DRD_64.menu.pnum.DRD_F091RC.node=NODE_F091RC
DRD_64.menu.pnum.DRD_F091RC.upload.maximum_size=262144
DRD_64.menu.pnum.DRD_F091RC.upload.maximum_data_size=32768
DRD_64.menu.pnum.DRD_F091RC.build.mcu=cortex-m0
DRD_64.menu.pnum.DRD_F091RC.build.board=DRD_Blink_F091RC
DRD_64.menu.pnum.DRD_F091RC.build.series=STM32F0xx
DRD_64.menu.pnum.DRD_F091RC.build.product_line=STM32F091xC
DRD_64.menu.pnum.DRD_F091RC.build.variant=DRD_Blink_F091RC
DRD_64.menu.pnum.DRD_F091RC.build.cmsis_lib_gcc=arm_cortexM0l_math

# DRD_F103RB board
DRD_64.menu.pnum.DRD_F103RB=DRD F103RB
DRD_64.menu.pnum.DRD_F103RB.node="NODE_F103RB,DRD"
DRD_64.menu.pnum.DRD_F103RB.upload.maximum_size=131072
DRD_64.menu.pnum.DRD_F103RB.upload.maximum_data_size=20480
DRD_64.menu.pnum.DRD_F103RB.build.mcu=cortex-m3
DRD_64.menu.pnum.DRD_F103RB.build.board=DRD_Blink_F103RB
DRD_64.menu.pnum.DRD_F103RB.build.series=STM32F1xx
DRD_64.menu.pnum.DRD_F103RB.build.product_line=STM32F103xB
DRD_64.menu.pnum.DRD_F103RB.build.variant=DRD_Blink_F103RB
DRD_64.menu.pnum.DRD_F103RB.build.cmsis_lib_gcc=arm_cortexM3l_math

# DRD_F302R8 board
DRD_64.menu.pnum.DRD_F302R8=DRD F302R8
DRD_64.menu.pnum.DRD_F302R8.node=NODE_F302R8
DRD_64.menu.pnum.DRD_F302R8.upload.maximum_size=65536
DRD_64.menu.pnum.DRD_F302R8.upload.maximum_data_size=16384
DRD_64.menu.pnum.DRD_F302R8.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
DRD_64.menu.pnum.DRD_F302R8.build.board=DRD_Blink_F302R8
DRD_64.menu.pnum.DRD_F302R8.build.series=STM32F3xx
DRD_64.menu.pnum.DRD_F302R8.build.product_line=STM32F302x8
DRD_64.menu.pnum.DRD_F302R8.build.variant=DRD_Blink_F302R8
DRD_64.menu.pnum.DRD_F302R8.build.cmsis_lib_gcc=arm_cortexM4l_math

# DRD_F303RE board
DRD_64.menu.pnum.DRD_F303RE=DRD F303RE
DRD_64.menu.pnum.DRD_F303RE.node=NODE_F303RE
DRD_64.menu.pnum.DRD_F303RE.upload.maximum_size=524288
DRD_64.menu.pnum.DRD_F303RE.upload.maximum_data_size=65536
DRD_64.menu.pnum.DRD_F303RE.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
DRD_64.menu.pnum.DRD_F303RE.build.board=DRD_Blink_F303RE
DRD_64.menu.pnum.DRD_F303RE.build.series=STM32F3xx
DRD_64.menu.pnum.DRD_F303RE.build.product_line=STM32F303xE
DRD_64.menu.pnum.DRD_F303RE.build.variant=DRD_Blink_F303RE
DRD_64.menu.pnum.DRD_F303RE.build.cmsis_lib_gcc=arm_cortexM4l_math

# DRD_F401RE board
DRD_64.menu.pnum.DRD_F401RE=DRD F401RE
DRD_64.menu.pnum.DRD_F401RE.node=NODE_F401RE
DRD_64.menu.pnum.DRD_F401RE.upload.maximum_size=524288
DRD_64.menu.pnum.DRD_F401RE.upload.maximum_data_size=98304
DRD_64.menu.pnum.DRD_F401RE.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
DRD_64.menu.pnum.DRD_F401RE.build.board=DRD_Blink_F401RE
DRD_64.menu.pnum.DRD_F401RE.build.series=STM32F4xx
DRD_64.menu.pnum.DRD_F401RE.build.product_line=STM32F401xE
DRD_64.menu.pnum.DRD_F401RE.build.variant=DRD_Blink_F401RE
DRD_64.menu.pnum.DRD_F401RE.build.cmsis_lib_gcc=arm_cortexM4l_math

# DRD_F411RE board
DRD_64.menu.pnum.DRD_F411RE=DRD F411RE
DRD_64.menu.pnum.DRD_F411RE.node="NODE_F411RE,DRD"
DRD_64.menu.pnum.DRD_F411RE.upload.maximum_size=524288
DRD_64.menu.pnum.DRD_F411RE.upload.maximum_data_size=131072
DRD_64.menu.pnum.DRD_F411RE.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
DRD_64.menu.pnum.DRD_F411RE.build.board=DRD_Blink_F411RE
DRD_64.menu.pnum.DRD_F411RE.build.series=STM32F4xx
DRD_64.menu.pnum.DRD_F411RE.build.product_line=STM32F411xE
DRD_64.menu.pnum.DRD_F411RE.build.variant=DRD_Blink_F411RE
DRD_64.menu.pnum.DRD_F411RE.build.cmsis_lib_gcc=arm_cortexM4l_math

