noeldiviney/Eicon/1.0.1/boards.txt
# DRD_F446RE board
DRD_64.menu.pnum.DRD_F446RE=DRD F446RE
DRD_64.menu.pnum.DRD_F446RE.node=NODE_F446RE
DRD_64.menu.pnum.DRD_F446RE.upload.maximum_size=524288
DRD_64.menu.pnum.DRD_F446RE.upload.maximum_data_size=131072
DRD_64.menu.pnum.DRD_F446RE.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
DRD_64.menu.pnum.DRD_F446RE.build.board=DRD_Blink_F446RE
DRD_64.menu.pnum.DRD_F446RE.build.series=STM32F4xx
DRD_64.menu.pnum.DRD_F446RE.build.product_line=STM32F446xx
DRD_64.menu.pnum.DRD_F446RE.build.variant=DRD_Blink_F446RE
DRD_64.menu.pnum.DRD_F446RE.build.cmsis_lib_gcc=arm_cortexM4l_math

# DRD_G071RB board
DRD_64.menu.pnum.DRD_G071RB=DRD G071RB
DRD_64.menu.pnum.DRD_G071RB.node=NODE_G071RB
DRD_64.menu.pnum.DRD_G071RB.upload.maximum_size=131072
DRD_64.menu.pnum.DRD_G071RB.upload.maximum_data_size=32768
DRD_64.menu.pnum.DRD_G071RB.build.mcu=cortex-m0plus
DRD_64.menu.pnum.DRD_G071RB.build.board=DRD_Blink_G071RB
DRD_64.menu.pnum.DRD_G071RB.build.series=STM32G0xx
DRD_64.menu.pnum.DRD_G071RB.build.product_line=STM32G071xx
DRD_64.menu.pnum.DRD_G071RB.build.variant=DRD_G071RB
DRD_64.menu.pnum.DRD_G071RB.build.cmsis_lib_gcc=arm_cortexM0l_math
DRD_64.menu.pnum.DRD_G071RB.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0

# DRD_L053R8 board
DRD_64.menu.pnum.DRD_L053R8=DRD L053R8
DRD_64.menu.pnum.DRD_L053R8.node=NODE_L053R8
DRD_64.menu.pnum.DRD_L053R8.upload.maximum_size=65536
DRD_64.menu.pnum.DRD_L053R8.upload.maximum_data_size=8192
DRD_64.menu.pnum.DRD_L053R8.build.mcu=cortex-m0plus
DRD_64.menu.pnum.DRD_L053R8.build.board=DRD_Blink_L053R8
DRD_64.menu.pnum.DRD_L053R8.build.series=STM32L0xx
DRD_64.menu.pnum.DRD_L053R8.build.product_line=STM32L053xx
DRD_64.menu.pnum.DRD_L053R8.build.variant=DRD_L053R8
DRD_64.menu.pnum.DRD_L053R8.build.cmsis_lib_gcc=arm_cortexM0l_math
DRD_64.menu.pnum.DRD_L053R8.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0

# DRD_L073RZ board
DRD_64.menu.pnum.DRD_L073RZ=DRD L073RZ
DRD_64.menu.pnum.DRD_L073RZ.node=NODE_L073RZ
DRD_64.menu.pnum.DRD_L073RZ.upload.maximum_size=196608
DRD_64.menu.pnum.DRD_L073RZ.upload.maximum_data_size=20480
DRD_64.menu.pnum.DRD_L073RZ.build.mcu=cortex-m0plus
DRD_64.menu.pnum.DRD_L073RZ.build.board=DRD_Blink_L073RZ
DRD_64.menu.pnum.DRD_L073RZ.build.series=STM32L0xx
DRD_64.menu.pnum.DRD_L073RZ.build.product_line=STM32L073xx
DRD_64.menu.pnum.DRD_L073RZ.build.variant=DRD_L073RZ
DRD_64.menu.pnum.DRD_L073RZ.build.cmsis_lib_gcc=arm_cortexM0l_math
DRD_64.menu.pnum.DRD_L073RZ.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0

# DRD_L152RE board
DRD_64.menu.pnum.DRD_L152RE=DRD L152RE
DRD_64.menu.pnum.DRD_L152RE.node="NODE_L152RE,DRD"
DRD_64.menu.pnum.DRD_L152RE.upload.maximum_size=524288
DRD_64.menu.pnum.DRD_L152RE.upload.maximum_data_size=81920
DRD_64.menu.pnum.DRD_L152RE.build.mcu=cortex-m3
DRD_64.menu.pnum.DRD_L152RE.build.board=DRD_Blink_L152RE
DRD_64.menu.pnum.DRD_L152RE.build.series=STM32L1xx
DRD_64.menu.pnum.DRD_L152RE.build.product_line=STM32L152xE
DRD_64.menu.pnum.DRD_L152RE.build.variant=DRD_L152RE
DRD_64.menu.pnum.DRD_L152RE.build.cmsis_lib_gcc=arm_cortexM3l_math

# DRD_L452RE board
DRD_64.menu.pnum.DRD_L452RE=DRD L452RE
DRD_64.menu.pnum.DRD_L452RE.node=NODE_L452RE
DRD_64.menu.pnum.DRD_L452RE.upload.maximum_size=524288
DRD_64.menu.pnum.DRD_L452RE.upload.maximum_data_size=163840
DRD_64.menu.pnum.DRD_L452RE.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
DRD_64.menu.pnum.DRD_L452RE.build.board=DRD_Blink_L452RE
DRD_64.menu.pnum.DRD_L452RE.build.series=STM32L4xx
DRD_64.menu.pnum.DRD_L452RE.build.product_line=STM32L452xx
DRD_64.menu.pnum.DRD_L452RE.build.variant=DRD_L452RE
DRD_64.menu.pnum.DRD_L452RE.build.cmsis_lib_gcc=arm_cortexM4l_math

# DRD_L476RG board
# Support: Serial1 (USART1 on PA10, PA9)
DRD_64.menu.pnum.DRD_L476RG=DRD L476RG
DRD_64.menu.pnum.DRD_L476RG.node=NODE_L476RG
DRD_64.menu.pnum.DRD_L476RG.upload.maximum_size=1048576
DRD_64.menu.pnum.DRD_L476RG.upload.maximum_data_size=98304
DRD_64.menu.pnum.DRD_L476RG.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
DRD_64.menu.pnum.DRD_L476RG.build.board=DRD_Blink_L476RG
DRD_64.menu.pnum.DRD_L476RG.build.series=STM32L4xx
DRD_64.menu.pnum.DRD_L476RG.build.product_line=STM32L476xx
DRD_64.menu.pnum.DRD_L476RG.build.variant=DRD_L476RG
DRD_64.menu.pnum.DRD_L476RG.build.cmsis_lib_gcc=arm_cortexM4l_math

# PDRD_WB55RG board
DRD_64.menu.pnum.PDRD_WB55RG=P-DRD WB55RG
DRD_64.menu.pnum.PDRD_WB55RG.node=NODE_WB55RG
DRD_64.menu.pnum.PDRD_WB55RG.upload.maximum_size=524288
DRD_64.menu.pnum.PDRD_WB55RG.upload.maximum_data_size=196604
DRD_64.menu.pnum.PDRD_WB55RG.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
DRD_64.menu.pnum.PDRD_WB55RG.build.board=PDRD_WB55RG
DRD_64.menu.pnum.PDRD_WB55RG.build.series=STM32WBxx
DRD_64.menu.pnum.PDRD_WB55RG.build.product_line=STM32WB55xx
DRD_64.menu.pnum.PDRD_WB55RG.build.variant=PDRD_WB55RG
DRD_64.menu.pnum.PDRD_WB55RG.build.cmsis_lib_gcc=arm_cortexM4l_math

# Upload menu
DRD_64.menu.upload_method.MassStorage=Mass Storage
DRD_64.menu.upload_method.MassStorage.upload.protocol=
DRD_64.menu.upload_method.MassStorage.upload.tool=massStorageCopy

DRD_64.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
DRD_64.menu.upload_method.swdMethod.upload.protocol=0
DRD_64.menu.upload_method.swdMethod.upload.options=-g
DRD_64.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

DRD_64.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
DRD_64.menu.upload_method.serialMethod.upload.protocol=1
DRD_64.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
DRD_64.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

DRD_64.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
DRD_64.menu.upload_method.dfuMethod.upload.protocol=2
DRD_64.menu.upload_method.dfuMethod.upload.options=-g
DRD_64.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# DRD 32 boards

