noeldiviney/Eicon/1.0.1/boards.txt
DRD_32.name=DRD-32

DRD_32.build.vid=0x0483
DRD_32.build.core=arduino
DRD_32.build.board=DRD_32
DRD_32.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# DRD_L031K6 board
DRD_32.menu.pnum.DRD_L031K6=DRD L031K6
DRD_32.menu.pnum.DRD_L031K6.node=NODE_L031K6
DRD_32.menu.pnum.DRD_L031K6.upload.maximum_size=32768
DRD_32.menu.pnum.DRD_L031K6.upload.maximum_data_size=8192
DRD_32.menu.pnum.DRD_L031K6.build.mcu=cortex-m0plus
DRD_32.menu.pnum.DRD_L031K6.build.board=DRD_Blink_L031K6
DRD_32.menu.pnum.DRD_L031K6.build.series=STM32L0xx
DRD_32.menu.pnum.DRD_L031K6.build.product_line=STM32L031xx
DRD_32.menu.pnum.DRD_L031K6.build.variant=DRD_L031K6
DRD_32.menu.pnum.DRD_L031K6.build.cmsis_lib_gcc=arm_cortexM0l_math

# DRD_L412KB board
DRD_32.menu.pnum.DRD_L412KB=DRD L412KB
DRD_32.menu.pnum.DRD_L412KB.node=NODE_L412KB
DRD_32.menu.pnum.DRD_L412KB.upload.maximum_size=131072
DRD_32.menu.pnum.DRD_L412KB.upload.maximum_data_size=40960
DRD_32.menu.pnum.DRD_L412KB.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
DRD_32.menu.pnum.DRD_L412KB.build.board=DRD_Blink_L412KB
DRD_32.menu.pnum.DRD_L412KB.build.series=STM32L4xx
DRD_32.menu.pnum.DRD_L412KB.build.product_line=STM32L412xx
DRD_32.menu.pnum.DRD_L412KB.build.variant=DRD_L412KB
DRD_32.menu.pnum.DRD_L412KB.build.cmsis_lib_gcc=arm_cortexM4l_math

# DRD_L432KC board
DRD_32.menu.pnum.DRD_L432KC=DRD L432KC
DRD_32.menu.pnum.DRD_L432KC.node=NODE_L432KC
DRD_32.menu.pnum.DRD_L432KC.upload.maximum_size=262144
DRD_32.menu.pnum.DRD_L432KC.upload.maximum_data_size=65536
DRD_32.menu.pnum.DRD_L432KC.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
DRD_32.menu.pnum.DRD_L432KC.build.board=DRD_Blink_L432KC
DRD_32.menu.pnum.DRD_L432KC.build.series=STM32L4xx
DRD_32.menu.pnum.DRD_L432KC.build.product_line=STM32L432xx
DRD_32.menu.pnum.DRD_L432KC.build.variant=DRD_L432KC
DRD_32.menu.pnum.DRD_L432KC.build.cmsis_lib_gcc=arm_cortexM4l_math

# DRD_F303K8 board
DRD_32.menu.pnum.DRD_F303K8=DRD F303K8
DRD_32.menu.pnum.DRD_F303K8.node=NODE_F303K8
DRD_32.menu.pnum.DRD_F303K8.upload.maximum_size=65536
DRD_32.menu.pnum.DRD_F303K8.upload.maximum_data_size=12288
DRD_32.menu.pnum.DRD_F303K8.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
DRD_32.menu.pnum.DRD_F303K8.build.board=DRD_Blink_F303K8
DRD_32.menu.pnum.DRD_F303K8.build.series=STM32F3xx
DRD_32.menu.pnum.DRD_F303K8.build.product_line=STM32F303x8
DRD_32.menu.pnum.DRD_F303K8.build.variant=DRD_Blink_F303K8
DRD_32.menu.pnum.DRD_F303K8.build.cmsis_lib_gcc=arm_cortexM4l_math

# Upload menu
DRD_32.menu.upload_method.MassStorage=Mass Storage
DRD_32.menu.upload_method.MassStorage.upload.protocol=
DRD_32.menu.upload_method.MassStorage.upload.tool=massStorageCopy

DRD_32.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
DRD_32.menu.upload_method.swdMethod.upload.protocol=0
DRD_32.menu.upload_method.swdMethod.upload.options=-g
DRD_32.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

DRD_32.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
DRD_32.menu.upload_method.serialMethod.upload.protocol=1
DRD_32.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
DRD_32.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

DRD_32.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
DRD_32.menu.upload_method.dfuMethod.upload.protocol=2
DRD_32.menu.upload_method.dfuMethod.upload.options=-g
DRD_32.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Discovery boards

Disco.name=Discovery

Disco.build.vid=0x0483
Disco.build.core=STM32:arduino
Disco.build.board=Disco
Disco.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# DISCO_F030R8 board
Disco.menu.pnum.DISCO_F030R8=STM32F030R8-DISCVL
Disco.menu.pnum.DISCO_F030R8.node="No_mass_storage_for_this_board_Use_STLink_upload_method"
Disco.menu.pnum.DISCO_F030R8.upload.maximum_size=65536
Disco.menu.pnum.DISCO_F030R8.upload.maximum_data_size=8192
Disco.menu.pnum.DISCO_F030R8.build.mcu=cortex-m0
Disco.menu.pnum.DISCO_F030R8.build.board=DISCO_F030R8
Disco.menu.pnum.DISCO_F030R8.build.series=STM32F0xx
Disco.menu.pnum.DISCO_F030R8.build.product_line=STM32F030x8
Disco.menu.pnum.DISCO_F030R8.build.variant=DISCO_F030R8
Disco.menu.pnum.DISCO_F030R8.build.cmsis_lib_gcc=arm_cortexM0l_math

# DISCO_F072RB board
Disco.menu.pnum.DISCO_F072RB=STM32F072B-DISCOVERY
Disco.menu.pnum.DISCO_F072RB.node="No_mass_storage_for_this_board_Use_STLink_upload_method"
Disco.menu.pnum.DISCO_F072RB.upload.maximum_size=131072
Disco.menu.pnum.DISCO_F072RB.upload.maximum_data_size=16384
Disco.menu.pnum.DISCO_F072RB.build.mcu=cortex-m0
Disco.menu.pnum.DISCO_F072RB.build.board=DISCO_F072RB
Disco.menu.pnum.DISCO_F072RB.build.series=STM32F0xx
Disco.menu.pnum.DISCO_F072RB.build.product_line=STM32F072xB
Disco.menu.pnum.DISCO_F072RB.build.variant=DISCO_F072RB
Disco.menu.pnum.DISCO_F072RB.build.cmsis_lib_gcc=arm_cortexM0l_math

#DISCO_F100RB board
Disco.menu.pnum.DISCO_F100RB=STM32F100RB-DISCVL
Disco.menu.pnum.DISCO_F100RB.node=DIS_F100RB
Disco.menu.pnum.DISCO_F100RB.upload.maximum_size=131071
Disco.menu.pnum.DISCO_F100RB.upload.maximum_data_size=8192
Disco.menu.pnum.DISCO_F100RB.build.mcu=cortex-m3
Disco.menu.pnum.DISCO_F100RB.build.board=DISCO_F100RB
Disco.menu.pnum.DISCO_F100RB.build.series=STM32F1xx
Disco.menu.pnum.DISCO_F100RB.build.product_line=STM32F100xB
Disco.menu.pnum.DISCO_F100RB.build.variant=DISCO_F100RB
Disco.menu.pnum.DISCO_F100RB.build.cmsis_lib_gcc=arm_cortexM3l_math

# DISCO_F407VG board
Disco.menu.pnum.DISCO_F407VG=STM32F407G-DISC1
Disco.menu.pnum.DISCO_F407VG.node=DIS_F407VG
Disco.menu.pnum.DISCO_F407VG.upload.maximum_size=1048576
Disco.menu.pnum.DISCO_F407VG.upload.maximum_data_size=196608
Disco.menu.pnum.DISCO_F407VG.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
Disco.menu.pnum.DISCO_F407VG.build.board=DISCO_F407VG
Disco.menu.pnum.DISCO_F407VG.build.series=STM32F4xx
Disco.menu.pnum.DISCO_F407VG.build.product_line=STM32F407xx
Disco.menu.pnum.DISCO_F407VG.build.variant=DISCO_F407VG
Disco.menu.pnum.DISCO_F407VG.build.cmsis_lib_gcc=arm_cortexM4l_math

# DISCO_F746NG board
Disco.menu.pnum.DISCO_F746NG=STM32F746G-DISCOVERY
Disco.menu.pnum.DISCO_F746NG.node=DIS_F746NG
Disco.menu.pnum.DISCO_F746NG.upload.maximum_size=1048576
Disco.menu.pnum.DISCO_F746NG.upload.maximum_data_size=327680
Disco.menu.pnum.DISCO_F746NG.build.mcu=cortex-m7 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
Disco.menu.pnum.DISCO_F746NG.build.board=DISCO_F746NG
Disco.menu.pnum.DISCO_F746NG.build.series=STM32F7xx
Disco.menu.pnum.DISCO_F746NG.build.product_line=STM32F746xx
Disco.menu.pnum.DISCO_F746NG.build.variant=DISCO_F746NG
Disco.menu.pnum.DISCO_F746NG.build.cmsis_lib_gcc=arm_cortexM7l_math

