noeldiviney/Eicon/1.0.1/boards.txt
# DISCO_L475VG_IOT board
Disco.menu.pnum.DISCO_L475VG_IOT=STM32L475VG-DISCOVERY-IOT
Disco.menu.pnum.DISCO_L475VG_IOT.node=DIS_L4IOT
Disco.menu.pnum.DISCO_L475VG_IOT.upload.maximum_size=1048576
Disco.menu.pnum.DISCO_L475VG_IOT.upload.maximum_data_size=98304
Disco.menu.pnum.DISCO_L475VG_IOT.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
Disco.menu.pnum.DISCO_L475VG_IOT.build.board=DISCO_L475VG_IOT
Disco.menu.pnum.DISCO_L475VG_IOT.build.series=STM32L4xx
Disco.menu.pnum.DISCO_L475VG_IOT.build.product_line=STM32L475xx
Disco.menu.pnum.DISCO_L475VG_IOT.build.variant=DISCO_L475VG_IOT
Disco.menu.pnum.DISCO_L475VG_IOT.build.cmsis_lib_gcc=arm_cortexM4l_math

# DISCO-L072CZ-LRWAN1 board
Disco.menu.pnum.DISCO_L072CZ_LRWAN1=Discovery L072CZ-LRWAN1
Disco.menu.pnum.DISCO_L072CZ_LRWAN1.node="DIS_L072Z,NODE_L072CZ"
Disco.menu.pnum.DISCO_L072CZ_LRWAN1.upload.maximum_size=196608
Disco.menu.pnum.DISCO_L072CZ_LRWAN1.upload.maximum_data_size=20480
Disco.menu.pnum.DISCO_L072CZ_LRWAN1.build.mcu=cortex-m0plus
Disco.menu.pnum.DISCO_L072CZ_LRWAN1.build.board=DISCO_L072CZ_LRWAN1
Disco.menu.pnum.DISCO_L072CZ_LRWAN1.build.series=STM32L0xx
Disco.menu.pnum.DISCO_L072CZ_LRWAN1.build.product_line=STM32L072xx
Disco.menu.pnum.DISCO_L072CZ_LRWAN1.build.variant=DISCO_L072CZ_LRWAN1
Disco.menu.pnum.DISCO_L072CZ_LRWAN1.build.cmsis_lib_gcc=arm_cortexM0l_math
Disco.menu.pnum.DISCO_L072CZ_LRWAN1.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0

# Upload menu
Disco.menu.upload_method.MassStorage=Mass Storage
Disco.menu.upload_method.MassStorage.upload.protocol=
Disco.menu.upload_method.MassStorage.upload.tool=massStorageCopy

Disco.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Disco.menu.upload_method.swdMethod.upload.protocol=0
Disco.menu.upload_method.swdMethod.upload.options=-g
Disco.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

Disco.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
Disco.menu.upload_method.serialMethod.upload.protocol=1
Disco.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
Disco.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

Disco.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Disco.menu.upload_method.dfuMethod.upload.protocol=2
Disco.menu.upload_method.dfuMethod.upload.options=-g
Disco.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Other boards

###############################
# Generic F0
GenF0.name=GenF0 series

GenF0.build.core=STM32:arduino
GenF0.build.board=GenF0
GenF0.build.extra_flags=-D{build.product_line} {build.xSerial}

# DEMO_F030F4 board
GenF0.menu.pnum.DEMO_F030F4=STM32F030F4 Demo board
GenF0.menu.pnum.DEMO_F030F4.upload.maximum_data_size=4096
GenF0.menu.pnum.DEMO_F030F4.upload.maximum_size=16384
GenF0.menu.pnum.DEMO_F030F4.build.mcu=cortex-m0
GenF0.menu.pnum.DEMO_F030F4.build.board=DEMO_F030F4
GenF0.menu.pnum.DEMO_F030F4.build.series=STM32F0xx
GenF0.menu.pnum.DEMO_F030F4.build.product_line=STM32F030x6
GenF0.menu.pnum.DEMO_F030F4.build.variant=DEMO_F030F4
GenF0.menu.pnum.DEMO_F030F4.build.cmsis_lib_gcc=arm_cortexM0l_math

# Upload menu
GenF0.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenF0.menu.upload_method.swdMethod.upload.protocol=0
GenF0.menu.upload_method.swdMethod.upload.options=-g
GenF0.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenF0.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenF0.menu.upload_method.serialMethod.upload.protocol=1
GenF0.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenF0.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenF0.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenF0.menu.upload_method.dfuMethod.upload.protocol=2
GenF0.menu.upload_method.dfuMethod.upload.options=-g
GenF0.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Generic F1
GenF1.name=GenF1 series

GenF1.build.vid=0x0483
GenF1.build.core=STM32:arduino
GenF1.build.board=GenF1
GenF1.build.mcu=cortex-m3
GenF1.build.series=STM32F1xx
GenF1.build.cmsis_lib_gcc=arm_cortexM3l_math
GenF1.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}

# BLUEPILL_F103CB board
GenF1.menu.pnum.BLUEPILL_F103CB=BLUEPILL F103CB (128k)
GenF1.menu.pnum.BLUEPILL_F103CB.upload.maximum_size=131072
GenF1.menu.pnum.BLUEPILL_F103CB.upload.maximum_data_size=20480
GenF1.menu.pnum.BLUEPILL_F103CB.build.board=BLUEPILL_F103CB
GenF1.menu.pnum.BLUEPILL_F103CB.build.product_line=STM32F103xB
GenF1.menu.pnum.BLUEPILL_F103CB.build.variant=BLUEPILL_F103CB

# BLUEPILL_Blink_F103XX board
GenF1.menu.pnum.BLUEPILL_F103XX=BLUEPILL Blink F103XX
GenF1.menu.pnum.BLUEPILL_F103XX.upload.maximum_size=131072
GenF1.menu.pnum.BLUEPILL_F103XX.upload.maximum_data_size=20480
GenF1.menu.pnum.BLUEPILL_F103XX.build.board=BLUEPILL_Blink_F103XX
GenF1.menu.pnum.BLUEPILL_F103XX.build.product_line=STM32F103xB
GenF1.menu.pnum.BLUEPILL_F103XX.build.variant=BLUEPILL_Blink_F103XX

# BLUEPILL_F103C6 board
#GenF1.menu.pnum.BLUEPILL_F103C6=BluePill F103C6 (32K)
#GenF1.menu.pnum.BLUEPILL_F103C6.upload.maximum_size=32768
#GenF1.menu.pnum.BLUEPILL_F103C6.upload.maximum_data_size=10240
#GenF1.menu.pnum.BLUEPILL_F103C6.build.board=BLUEPILL_F103C6
#GenF1.menu.pnum.BLUEPILL_F103C6.build.product_line=STM32F103x6
#GenF1.menu.pnum.BLUEPILL_F103C6.build.variant=PILL_F103XX

# BLUEPILL_F103C8 board
#GenF1.menu.pnum.BLUEPILL_F103C8=BluePill F103C8
#GenF1.menu.pnum.BLUEPILL_F103C8.upload.maximum_size=65536
#GenF1.menu.pnum.BLUEPILL_F103C8.upload.maximum_data_size=20480
#GenF1.menu.pnum.BLUEPILL_F103C8.build.board=BLUEPILL_F103C8
#GenF1.menu.pnum.BLUEPILL_F103C8.build.product_line=STM32F103xB
#GenF1.menu.pnum.BLUEPILL_F103C8.build.variant=PILL_F103XX

