noeldiviney/Eicon/1.0.1/boards.txt
#GenF1.menu.pnum.BLUEPILL_F103C8B=BluePill F103CB (128k)
#GenF1.menu.pnum.BLUEPILL_F103C8B.upload.maximum_size=131072
#GenF1.menu.pnum.BLUEPILL_F103C8B.upload.maximum_data_size=20480
#GenF1.menu.pnum.BLUEPILL_F103C8B.build.board=BLUEPILL_F103C8
#GenF1.menu.pnum.BLUEPILL_F103C8B.build.product_line=STM32F103xB
#GenF1.menu.pnum.BLUEPILL_F103C8B.build.variant=PILL_F103XX

# BLACKPILL_F103C8 board
#GenF1.menu.pnum.BLACKPILL_F103C8=BlackPill F103C8
#GenF1.menu.pnum.BLACKPILL_F103C8.upload.maximum_size=65536
#GenF1.menu.pnum.BLACKPILL_F103C8.upload.maximum_data_size=20480
#GenF1.menu.pnum.BLACKPILL_F103C8.build.board=BLACKPILL_F103C8
#GenF1.menu.pnum.BLACKPILL_F103C8.build.product_line=STM32F103xB
#GenF1.menu.pnum.BLACKPILL_F103C8.build.variant=PILL_F103XX

#GenF1.menu.pnum.BLACKPILL_F103C8B=BlackPill F103C8 (128k)
#GenF1.menu.pnum.BLACKPILL_F103C8B.upload.maximum_size=131072
#GenF1.menu.pnum.BLACKPILL_F103C8B.upload.maximum_data_size=20480
#GenF1.menu.pnum.BLACKPILL_F103C8B.build.board=BLACKPILL_F103C8
#GenF1.menu.pnum.BLACKPILL_F103C8B.build.product_line=STM32F103xB
#GenF1.menu.pnum.BLACKPILL_F103C8B.build.variant=PILL_F103XX

# Upload menu
GenF1.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenF1.menu.upload_method.swdMethod.upload.protocol=0
GenF1.menu.upload_method.swdMethod.upload.options=-g
GenF1.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenF1.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenF1.menu.upload_method.serialMethod.upload.protocol=1
GenF1.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenF1.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenF1.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenF1.menu.upload_method.dfuMethod.upload.protocol=2
GenF1.menu.upload_method.dfuMethod.upload.options=-g
GenF1.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenF1.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenF1.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenF1.menu.upload_method.bmpMethod.upload.tool=bmp_upload

GenF1.menu.upload_method.hidMethod=HID Bootloader 2.2
GenF1.menu.upload_method.hidMethod.upload.protocol=hid22
GenF1.menu.upload_method.hidMethod.upload.tool=hid_upload
GenF1.menu.upload_method.hidMethod.build.flash_offset=0x800
GenF1.menu.upload_method.hidMethod.build.bootloader_flags=-DBL_HID -DVECT_TAB_OFFSET={build.flash_offset}                         

GenF1.menu.upload_method.dfu2Method=Maple DFU Bootloader 2.0
GenF1.menu.upload_method.dfu2Method.upload.protocol=maple
GenF1.menu.upload_method.dfu2Method.upload.tool=maple_upload
GenF1.menu.upload_method.dfu2Method.upload.usbID=1EAF:0003
GenF1.menu.upload_method.dfu2Method.upload.altID=2
GenF1.menu.upload_method.dfu2Method.build.flash_offset=0x2000
GenF1.menu.upload_method.dfu2Method.build.bootloader_flags=-DBL_LEGACY_LEAF -DVECT_TAB_OFFSET={build.flash_offset}

GenF1.menu.upload_method.dfuoMethod=Maple DFU Bootloader original
GenF1.menu.upload_method.dfuoMethod.upload.protocol=maple
GenF1.menu.upload_method.dfuoMethod.upload.tool=maple_upload
GenF1.menu.upload_method.dfuoMethod.upload.usbID=1EAF:0003
GenF1.menu.upload_method.dfuoMethod.upload.altID=1
GenF1.menu.upload_method.dfuoMethod.build.flash_offset=0x5000
GenF1.menu.upload_method.dfuoMethod.build.bootloader_flags=-DBL_LEGACY_LEAF -DVECT_TAB_OFFSET={build.flash_offset}

################################################################################
# Generic F3

GenF3.name=GenF3 series

GenF3.build.vid=0x0483
GenF3.build.core=STM32:arduino
GenF3.build.board=GenF3
GenF3.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}
GenF3.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
GenF3.build.series=STM32F3xx
GenF3.build.cmsis_lib_gcc=arm_cortexM4l_math

# BLACKPILL_F303CC
GenF3.menu.pnum.BLACKPILL_F303XX=RobotDyn BlackPill F303CC
GenF3.menu.pnum.BLACKPILL_F303XX.upload.maximum_size=262144
GenF3.menu.pnum.BLACKPILL_F303XX.upload.maximum_data_size=40960
GenF3.menu.pnum.BLACKPILL_F303XX.build.board=BLACKPILL_F303CC
GenF3.menu.pnum.BLACKPILL_F303XX.build.product_line=STM32F303xC
GenF3.menu.pnum.BLACKPILL_F303XX.build.variant=PILL_F303XX

# Upload menu
GenF3.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenF3.menu.upload_method.swdMethod.upload.protocol=0
GenF3.menu.upload_method.swdMethod.upload.options=-g
GenF3.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenF3.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenF3.menu.upload_method.serialMethod.upload.protocol=1
GenF3.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenF3.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenF3.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenF3.menu.upload_method.dfuMethod.upload.protocol=2
GenF3.menu.upload_method.dfuMethod.upload.options=-g
GenF3.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenF3.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenF3.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenF3.menu.upload_method.bmpMethod.upload.tool=bmp_upload

################################################################################
# Generic F4

GenF4.name=GenF4 series

GenF4.build.vid=0x0483
GenF4.build.core=STM32:arduino
GenF4.build.board=GenF4
GenF4.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}
GenF4.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
GenF4.build.series=STM32F4xx
GenF4.build.cmsis_lib_gcc=arm_cortexM4l_math

# Black F407VE
GenF4.menu.pnum.BLACK_F407VE=Black F407VE
GenF4.menu.pnum.BLACK_F407VE.upload.maximum_size=524288
GenF4.menu.pnum.BLACK_F407VE.upload.maximum_data_size=131072
GenF4.menu.pnum.BLACK_F407VE.build.board=BLACK_F407VE
GenF4.menu.pnum.BLACK_F407VE.build.product_line=STM32F407xx
GenF4.menu.pnum.BLACK_F407VE.build.variant=BLACK_F407XX

# Black F407VG
GenF4.menu.pnum.BLACK_F407VG=Black F407VG
GenF4.menu.pnum.BLACK_F407VG.upload.maximum_size=1048576
GenF4.menu.pnum.BLACK_F407VG.upload.maximum_data_size=131072
GenF4.menu.pnum.BLACK_F407VG.build.board=BLACK_F407VG
GenF4.menu.pnum.BLACK_F407VG.build.product_line=STM32F407xx
GenF4.menu.pnum.BLACK_F407VG.build.variant=BLACK_F407XX

# Black F407ZE
GenF4.menu.pnum.BLACK_F407ZE=Black F407ZE
GenF4.menu.pnum.BLACK_F407ZE.upload.maximum_size=524288
GenF4.menu.pnum.BLACK_F407ZE.upload.maximum_data_size=131072
GenF4.menu.pnum.BLACK_F407ZE.build.board=BLACK_F407ZE
GenF4.menu.pnum.BLACK_F407ZE.build.product_line=STM32F407xx
GenF4.menu.pnum.BLACK_F407ZE.build.variant=BLACK_F407XX

# Black F407ZG
GenF4.menu.pnum.BLACK_F407ZG=Black F407ZG
GenF4.menu.pnum.BLACK_F407ZG.upload.maximum_size=1048576
GenF4.menu.pnum.BLACK_F407ZG.upload.maximum_data_size=131072
GenF4.menu.pnum.BLACK_F407ZG.build.board=BLACK_F407ZG
GenF4.menu.pnum.BLACK_F407ZG.build.product_line=STM32F407xx
GenF4.menu.pnum.BLACK_F407ZG.build.variant=BLACK_F407XX

