noeldiviney/Eicon/1.0.1/boards.txt
# ARMED_V1 board
3dprinter.menu.pnum.ARMED_V1=Armed V1
3dprinter.menu.pnum.ARMED_V1.upload.maximum_size=1048576
3dprinter.menu.pnum.ARMED_V1.upload.maximum_data_size=196608
3dprinter.menu.pnum.ARMED_V1.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
3dprinter.menu.pnum.ARMED_V1.build.board=ARMED_V1
3dprinter.menu.pnum.ARMED_V1.build.series=STM32F4xx
3dprinter.menu.pnum.ARMED_V1.build.product_line=STM32F407xx
3dprinter.menu.pnum.ARMED_V1.build.variant=ARMED_V1
3dprinter.menu.pnum.ARMED_V1.build.cmsis_lib_gcc=arm_cortexM4l_math
3dprinter.menu.pnum.ARMED_V1.build.vid=0x0483
3dprinter.menu.pnum.ARMED_V1.build.pid=0x5740

# REMRAM_V1 board
3dprinter.menu.pnum.REMRAM_V1=RemRam v1
3dprinter.menu.pnum.REMRAM_V1.upload.maximum_size=2097152
3dprinter.menu.pnum.REMRAM_V1.upload.maximum_data_size=524288
3dprinter.menu.pnum.REMRAM_V1.build.mcu=cortex-m7 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
3dprinter.menu.pnum.REMRAM_V1.build.board=REMRAM_V1
3dprinter.menu.pnum.REMRAM_V1.build.series=STM32F7xx
3dprinter.menu.pnum.REMRAM_V1.build.product_line=STM32F765xx
3dprinter.menu.pnum.REMRAM_V1.build.variant=REMRAM_V1
3dprinter.menu.pnum.REMRAM_V1.build.cmsis_lib_gcc=arm_cortexM7l_math

# RUMBA32 board
3dprinter.menu.pnum.RUMBA32=RUMBA32
3dprinter.menu.pnum.RUMBA32.upload.maximum_size=524288
3dprinter.menu.pnum.RUMBA32.upload.maximum_data_size=131072
3dprinter.menu.pnum.RUMBA32.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
3dprinter.menu.pnum.RUMBA32.build.board=RUMBA32_F446VE
3dprinter.menu.pnum.RUMBA32.build.series=STM32F4xx
3dprinter.menu.pnum.RUMBA32.build.product_line=STM32F446xx
3dprinter.menu.pnum.RUMBA32.build.variant=RUMBA32_F446VE
3dprinter.menu.pnum.RUMBA32.build.cmsis_lib_gcc=arm_cortexM4l_math

# STEVAL-3DP001V1 board
3dprinter.menu.pnum.ST3DP001_EVAL=STEVAL-3DP001V1
3dprinter.menu.pnum.ST3DP001_EVAL.upload.maximum_size=524288
3dprinter.menu.pnum.ST3DP001_EVAL.upload.maximum_data_size=98304
3dprinter.menu.pnum.ST3DP001_EVAL.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
3dprinter.menu.pnum.ST3DP001_EVAL.build.board=ST3DP001_EVAL
3dprinter.menu.pnum.ST3DP001_EVAL.build.series=STM32F4xx
3dprinter.menu.pnum.ST3DP001_EVAL.build.product_line=STM32F401xE
3dprinter.menu.pnum.ST3DP001_EVAL.build.variant=ST3DP001_EVAL
3dprinter.menu.pnum.ST3DP001_EVAL.build.cmsis_lib_gcc=arm_cortexM4l_math

# PRNTR_F407_V1 board
3dprinter.menu.pnum.PRNTR_F407_V1=PRNTR F407 v1
3dprinter.menu.pnum.PRNTR_F407_V1.upload.maximum_size=524288
3dprinter.menu.pnum.PRNTR_F407_V1.upload.maximum_data_size=196608
3dprinter.menu.pnum.PRNTR_F407_V1.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
3dprinter.menu.pnum.PRNTR_F407_V1.build.board=PRNTR_F407_V1
3dprinter.menu.pnum.PRNTR_F407_V1.build.series=STM32F4xx
3dprinter.menu.pnum.PRNTR_F407_V1.build.product_line=STM32F407xx
3dprinter.menu.pnum.PRNTR_F407_V1.build.variant=PRNTR_F407_V1
3dprinter.menu.pnum.PRNTR_F407_V1.build.cmsis_lib_gcc=arm_cortexM4l_math

# EEXTR_F030_V1 board
3dprinter.menu.pnum.EEXTR_F030_V1=EExtruder F030 V1
3dprinter.menu.pnum.EEXTR_F030_V1.upload.maximum_size=65536
3dprinter.menu.pnum.EEXTR_F030_V1.upload.maximum_data_size=8192
3dprinter.menu.pnum.EEXTR_F030_V1.build.mcu=cortex-m0
3dprinter.menu.pnum.EEXTR_F030_V1.build.board=EEXTR_F030_V1
3dprinter.menu.pnum.EEXTR_F030_V1.build.series=STM32F0xx
3dprinter.menu.pnum.EEXTR_F030_V1.build.product_line=STM32F030x8
3dprinter.menu.pnum.EEXTR_F030_V1.build.variant=EEXTR_F030_V1
3dprinter.menu.pnum.EEXTR_F030_V1.build.cmsis_lib_gcc=arm_cortexM0l_math

# MALYANM200_F103CB board
3dprinter.menu.pnum.MALYANM200_F103CB=Malyan M200 V1
3dprinter.menu.pnum.MALYANM200_F103CB.upload.maximum_size=122880
3dprinter.menu.pnum.MALYANM200_F103CB.upload.maximum_data_size=20480
3dprinter.menu.pnum.MALYANM200_F103CB.build.mcu=cortex-m3
3dprinter.menu.pnum.MALYANM200_F103CB.build.board=MALYANM200_F103CB
3dprinter.menu.pnum.MALYANM200_F103CB.build.series=STM32F1xx
3dprinter.menu.pnum.MALYANM200_F103CB.build.product_line=STM32F103xB
3dprinter.menu.pnum.MALYANM200_F103CB.build.variant=MALYANM200_F103CB
3dprinter.menu.pnum.MALYANM200_F103CB.build.cmsis_lib_gcc=arm_cortexM3l_math
3dprinter.menu.pnum.MALYANM200_F103CB.build.startup_file=-DCUSTOM_STARTUP_FILE
3dprinter.menu.pnum.MALYANM200_F103CB.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -DVECT_TAB_OFFSET=0x2000

# MALYANM200_F070CB board
3dprinter.menu.pnum.MALYANM200_F070CB=Malyan M200 V2
3dprinter.menu.pnum.MALYANM200_F070CB.upload.maximum_size=122880
3dprinter.menu.pnum.MALYANM200_F070CB.upload.maximum_data_size=15168
3dprinter.menu.pnum.MALYANM200_F070CB.build.mcu=cortex-m0
3dprinter.menu.pnum.MALYANM200_F070CB.build.board=MALYANM200_F070CB
3dprinter.menu.pnum.MALYANM200_F070CB.build.series=STM32F0xx
3dprinter.menu.pnum.MALYANM200_F070CB.build.product_line=STM32F070xB
3dprinter.menu.pnum.MALYANM200_F070CB.build.variant=MALYANM200_F070CB
3dprinter.menu.pnum.MALYANM200_F070CB.build.cmsis_lib_gcc=arm_cortexM0l_math
3dprinter.menu.pnum.MALYANM200_F070CB.build.startup_file=-DCUSTOM_STARTUP_FILE
3dprinter.menu.pnum.MALYANM200_F070CB.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -DVECT_TAB_OFFSET=0x2000

# VAkE v1.0
3dprinter.menu.pnum.VAKE_F446VE=VAkE v1.0
3dprinter.menu.pnum.VAKE_F446VE.upload.maximum_size=524288
3dprinter.menu.pnum.VAKE_F446VE.upload.maximum_data_size=131072
3dprinter.menu.pnum.VAKE_F446VE.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
3dprinter.menu.pnum.VAKE_F446VE.build.board=VAKE403
3dprinter.menu.pnum.VAKE_F446VE.build.series=STM32F4xx
3dprinter.menu.pnum.VAKE_F446VE.build.product_line=STM32F446xx
3dprinter.menu.pnum.VAKE_F446VE.build.variant=VAKE_F446VE
3dprinter.menu.pnum.VAKE_F446VE.build.cmsis_lib_gcc=arm_cortexM4l_math

# Upload menu
3dprinter.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
3dprinter.menu.upload_method.swdMethod.upload.protocol=0
3dprinter.menu.upload_method.swdMethod.upload.options=-g
3dprinter.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

3dprinter.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
3dprinter.menu.upload_method.serialMethod.upload.protocol=1
3dprinter.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
3dprinter.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

3dprinter.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
3dprinter.menu.upload_method.dfuMethod.upload.protocol=2
3dprinter.menu.upload_method.dfuMethod.upload.options=-g
3dprinter.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Serialx activation
DRD_144.menu.xserial.generic=Enabled (generic 'Serial')
DRD_144.menu.xserial.none=Enabled (no generic 'Serial')
DRD_144.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
DRD_144.menu.xserial.disabled=Disabled (No Serial support)
DRD_144.menu.xserial.disabled.build.xSerial=

DRD_64.menu.xserial.generic=Enabled (generic 'Serial')
DRD_64.menu.xserial.none=Enabled (no generic 'Serial')
DRD_64.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
DRD_64.menu.xserial.disabled=Disabled (No Serial support)
DRD_64.menu.xserial.disabled.build.xSerial=

DRD_32.menu.xserial.generic=Enabled (generic 'Serial')
DRD_32.menu.xserial.none=Enabled (no generic 'Serial')
DRD_32.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
DRD_32.menu.xserial.disabled=Disabled (No Serial support)
DRD_32.menu.xserial.disabled.build.xSerial=

Disco.menu.xserial.generic=Enabled (generic 'Serial')
Disco.menu.xserial.none=Enabled (no generic 'Serial')
Disco.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Disco.menu.xserial.disabled=Disabled (no Serial support)
Disco.menu.xserial.disabled.build.xSerial=

GenF0.menu.xserial.generic=Enabled (generic 'Serial')
GenF0.menu.xserial.none=Enabled (no generic 'Serial')
GenF0.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF0.menu.xserial.disabled=Disabled (no Serial support)
GenF0.menu.xserial.disabled.build.xSerial=

GenF1.menu.xserial.generic=Enabled (generic 'Serial')
GenF1.menu.xserial.none=Enabled (no generic 'Serial')
GenF1.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF1.menu.xserial.disabled=Disabled (no Serial support)
GenF1.menu.xserial.disabled.build.xSerial=

GenF3.menu.xserial.generic=Enabled (generic 'Serial')
GenF3.menu.xserial.none=Enabled (no generic 'Serial')
GenF3.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF3.menu.xserial.disabled=Disabled (no Serial support)
GenF3.menu.xserial.disabled.build.xSerial=

GenF4.menu.xserial.generic=Enabled (generic 'Serial')
GenF4.menu.xserial.none=Enabled (no generic 'Serial')
GenF4.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
GenF4.menu.xserial.disabled=Disabled (no Serial support)
GenF4.menu.xserial.disabled.build.xSerial=

Sparky.menu.xserial.generic=Enabled (generic 'Serial')
Sparky.menu.xserial.none=Enabled (no generic 'Serial')
Sparky.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
Sparky.menu.xserial.disabled=Disabled (no Serial support)
Sparky.menu.xserial.disabled.build.xSerial=

RAK.menu.xserial.generic=Enabled (generic 'Serial')
RAK.menu.xserial.none=Enabled (no generic 'Serial')
RAK.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
RAK.menu.xserial.disabled=Disabled (no Serial support)
RAK.menu.xserial.disabled.build.xSerial=

3dprinter.menu.xserial.generic=Enabled (generic 'Serial')
3dprinter.menu.xserial.none=Enabled (no generic 'Serial')
3dprinter.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE
3dprinter.menu.xserial.disabled=Disabled (no Serial support)
3dprinter.menu.xserial.disabled.build.xSerial=

# USB connectivity
DRD_144.menu.usb.none=None
DRD_144.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
DRD_144.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
DRD_144.menu.usb.CDC=CDC (no generic 'Serial')
DRD_144.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
DRD_144.menu.usb.HID=HID (keyboard and mouse)
DRD_144.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
DRD_144.menu.xusb.FS=Low/Full Speed
DRD_144.menu.xusb.HS=High Speed
DRD_144.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
DRD_144.menu.xusb.HSFS=High Speed in Full Speed mode
DRD_144.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

DRD_64.menu.usb.none=None
DRD_64.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
DRD_64.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
DRD_64.menu.usb.CDC=CDC (no generic 'Serial')
DRD_64.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
DRD_64.menu.usb.HID=HID (keyboard and mouse)
DRD_64.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
DRD_64.menu.xusb.FS=Low/Full Speed
DRD_64.menu.xusb.HS=High Speed
DRD_64.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
DRD_64.menu.xusb.HSFS=High Speed in Full Speed mode
DRD_64.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

DRD_32.menu.usb.none=None
DRD_32.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
DRD_32.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
DRD_32.menu.usb.CDC=CDC (no generic 'Serial')
DRD_32.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
DRD_32.menu.usb.HID=HID (keyboard and mouse)
DRD_32.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
DRD_32.menu.xusb.FS=Low/Full Speed
DRD_32.menu.xusb.HS=High Speed
DRD_32.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
DRD_32.menu.xusb.HSFS=High Speed in Full Speed mode
DRD_32.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

