noeldiviney/Eicon/1.0.1/boards.txt
Disco.menu.opt.osstd=Smallest (-Os default)
Disco.menu.opt.oslto=Smallest (-Os) with LTO
Disco.menu.opt.oslto.build.flags.optimize=-Os -flto
Disco.menu.opt.o1std=Fast (-O1)
Disco.menu.opt.o1std.build.flags.optimize=-O1
Disco.menu.opt.o1lto=Fast (-O1) with LTO
Disco.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Disco.menu.opt.o2std=Faster (-O2)
Disco.menu.opt.o2std.build.flags.optimize=-O2
Disco.menu.opt.o2lto=Faster (-O2) with LTO
Disco.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Disco.menu.opt.o3std=Fastest (-O3)
Disco.menu.opt.o3std.build.flags.optimize=-O3
Disco.menu.opt.o3lto=Fastest (-O3) with LTO
Disco.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Disco.menu.opt.ogstd=Debug (-g)
Disco.menu.opt.ogstd.build.flags.optimize=-g -Og

GenF0.menu.opt.osstd=Smallest (-Os default)
GenF0.menu.opt.oslto=Smallest (-Os) with LTO
GenF0.menu.opt.oslto.build.flags.optimize=-Os -flto
GenF0.menu.opt.o1std=Fast (-O1)
GenF0.menu.opt.o1std.build.flags.optimize=-O1
GenF0.menu.opt.o1lto=Fast (-O1) with LTO
GenF0.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenF0.menu.opt.o2std=Faster (-O2)
GenF0.menu.opt.o2std.build.flags.optimize=-O2
GenF0.menu.opt.o2lto=Faster (-O2) with LTO
GenF0.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenF0.menu.opt.o3std=Fastest (-O3)
GenF0.menu.opt.o3std.build.flags.optimize=-O3
GenF0.menu.opt.o3lto=Fastest (-O3) with LTO
GenF0.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenF0.menu.opt.ogstd=Debug (-g)
GenF0.menu.opt.ogstd.build.flags.optimize=-g -Og

GenF1.menu.opt.osstd=Smallest (-Os default)
GenF1.menu.opt.oslto=Smallest (-Os) with LTO
GenF1.menu.opt.oslto.build.flags.optimize=-Os -flto
GenF1.menu.opt.o1std=Fast (-O1)
GenF1.menu.opt.o1std.build.flags.optimize=-O1
GenF1.menu.opt.o1lto=Fast (-O1) with LTO
GenF1.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenF1.menu.opt.o2std=Faster (-O2)
GenF1.menu.opt.o2std.build.flags.optimize=-O2
GenF1.menu.opt.o2lto=Faster (-O2) with LTO
GenF1.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenF1.menu.opt.o3std=Fastest (-O3)
GenF1.menu.opt.o3std.build.flags.optimize=-O3
GenF1.menu.opt.o3lto=Fastest (-O3) with LTO
GenF1.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenF1.menu.opt.ogstd=Debug (-g)
GenF1.menu.opt.ogstd.build.flags.optimize=-g -Og

GenF3.menu.opt.osstd=Smallest (-Os default)
GenF3.menu.opt.osstd.build.flags.optimize=-Os
GenF3.menu.opt.oslto=Smallest (-Os) with LTO
GenF3.menu.opt.oslto.build.flags.optimize=-Os -flto
GenF3.menu.opt.o1std=Fast (-O1)
GenF3.menu.opt.o1std.build.flags.optimize=-O1
GenF3.menu.opt.o1lto=Fast (-O1) with LTO
GenF3.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenF3.menu.opt.o2std=Faster (-O2)
GenF3.menu.opt.o2std.build.flags.optimize=-O2
GenF3.menu.opt.o2lto=Faster (-O2) with LTO
GenF3.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenF3.menu.opt.o3std=Fastest (-O3)
GenF3.menu.opt.o3std.build.flags.optimize=-O3
GenF3.menu.opt.o3lto=Fastest (-O3) with LTO
GenF3.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenF3.menu.opt.ogstd=Debug (-g)
GenF3.menu.opt.ogstd.build.flags.optimize=-g -Og

GenF4.menu.opt.osstd=Smallest (-Os default)
GenF4.menu.opt.osstd.build.flags.optimize=-Os
GenF4.menu.opt.oslto=Smallest (-Os) with LTO
GenF4.menu.opt.oslto.build.flags.optimize=-Os -flto
GenF4.menu.opt.o1std=Fast (-O1)
GenF4.menu.opt.o1std.build.flags.optimize=-O1
GenF4.menu.opt.o1lto=Fast (-O1) with LTO
GenF4.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenF4.menu.opt.o2std=Faster (-O2)
GenF4.menu.opt.o2std.build.flags.optimize=-O2
GenF4.menu.opt.o2lto=Faster (-O2) with LTO
GenF4.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenF4.menu.opt.o3std=Fastest (-O3)
GenF4.menu.opt.o3std.build.flags.optimize=-O3
GenF4.menu.opt.o3lto=Fastest (-O3) with LTO
GenF4.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenF4.menu.opt.ogstd=Debug (-g)
GenF4.menu.opt.ogstd.build.flags.optimize=-g -Og

Sparky.menu.opt.osstd=Smallest (-Os default)
Sparky.menu.opt.oslto=Smallest (-Os) with LTO
Sparky.menu.opt.oslto.build.flags.optimize=-Os -flto
Sparky.menu.opt.o1std=Fast (-O1)
Sparky.menu.opt.o1std.build.flags.optimize=-O1
Sparky.menu.opt.o1lto=Fast (-O1) with LTO
Sparky.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Sparky.menu.opt.o2std=Faster (-O2)
Sparky.menu.opt.o2std.build.flags.optimize=-O2
Sparky.menu.opt.o2lto=Faster (-O2) with LTO
Sparky.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Sparky.menu.opt.o3std=Fastest (-O3)
Sparky.menu.opt.o3std.build.flags.optimize=-O3
Sparky.menu.opt.o3lto=Fastest (-O3) with LTO
Sparky.menu.opt.o3lto.build.flags.optimize=-O3 -flto
Sparky.menu.opt.ogstd=Debug (-g)
Sparky.menu.opt.ogstd.build.flags.optimize=-g -Og

RAK.menu.opt.osstd=Smallest (-Os default)
RAK.menu.opt.oslto=Smallest (-Os) with LTO
RAK.menu.opt.oslto.build.flags.optimize=-Os -flto
RAK.menu.opt.o1std=Fast (-O1)
RAK.menu.opt.o1std.build.flags.optimize=-O1
RAK.menu.opt.o1lto=Fast (-O1) with LTO
RAK.menu.opt.o1lto.build.flags.optimize=-O1 -flto
RAK.menu.opt.o2std=Faster (-O2)
RAK.menu.opt.o2std.build.flags.optimize=-O2
RAK.menu.opt.o2lto=Faster (-O2) with LTO
RAK.menu.opt.o2lto.build.flags.optimize=-O2 -flto
RAK.menu.opt.o3std=Fastest (-O3)
RAK.menu.opt.o3std.build.flags.optimize=-O3
RAK.menu.opt.o3lto=Fastest (-O3) with LTO
RAK.menu.opt.o3lto.build.flags.optimize=-O3 -flto
RAK.menu.opt.ogstd=Debug (-g)
RAK.menu.opt.ogstd.build.flags.optimize=-g -Og

3dprinter.menu.opt.osstd=Smallest (-Os default)
3dprinter.menu.opt.oslto=Smallest (-Os) with LTO
3dprinter.menu.opt.oslto.build.flags.optimize=-Os -flto
3dprinter.menu.opt.o1std=Fast (-O1)
3dprinter.menu.opt.o1std.build.flags.optimize=-O1
3dprinter.menu.opt.o1lto=Fast (-O1) with LTO
3dprinter.menu.opt.o1lto.build.flags.optimize=-O1 -flto
3dprinter.menu.opt.o2std=Faster (-O2)
3dprinter.menu.opt.o2std.build.flags.optimize=-O2
3dprinter.menu.opt.o2lto=Faster (-O2) with LTO
3dprinter.menu.opt.o2lto.build.flags.optimize=-O2 -flto
3dprinter.menu.opt.o3std=Fastest (-O3)
3dprinter.menu.opt.o3std.build.flags.optimize=-O3
3dprinter.menu.opt.o3lto=Fastest (-O3) with LTO
3dprinter.menu.opt.o3lto.build.flags.optimize=-O3 -flto
3dprinter.menu.opt.ogstd=Debug (-g)
3dprinter.menu.opt.ogstd.build.flags.optimize=-g -Og

# C Runtime Library
DRD_144.menu.rtlib.nano=Newlib Nano (default)
DRD_144.menu.rtlib.nanofp=Newlib Nano + Float Printf
DRD_144.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
DRD_144.menu.rtlib.nanofs=Newlib Nano + Float Scanf
DRD_144.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
DRD_144.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
DRD_144.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
DRD_144.menu.rtlib.full=Newlib Standard
DRD_144.menu.rtlib.full.build.flags.ldspecs=

